<?php
/**
 * +----------------------------------------------------------------------
 * | 九月科技-ztuc.cn
 * +----------------------------------------------------------------------
 *                      .::::.
 *                    .::::::::.            | AUTHOR: siyu
 *                    :::::::::::           | EMAIL: ztucke@ztuc.cn
 *                 ..:::::::::::'           | DATETIME: 2020/01/31
 *             '::::::::::::'
 *                .::::::::::
 *           '::::::::::::::..
 *                ..::::::::::::.
 *              ``::::::::::::::::
 *               ::::``:::::::::'        .:::.
 *              ::::'   ':::::'       .::::::::.
 *            .::::'      ::::     .:::::::'::::.
 *           .:::'       :::::  .:::::::::' ':::::.
 *          .::'        :::::.:::::::::'      ':::::.
 *         .::'         ::::::::::::::'         ``::::.
 *     ...:::           ::::::::::::'              ``::.
 *   ```` ':.          ':::::::::'                  ::::..
 *                      '.:::::'                    ':'````..
 * +----------------------------------------------------------------------
 */
declare (strict_types = 1);

namespace app\validate\admin;

use think\Validate;

class Profile extends Validate
{
    /**
     * 定义验证规则
     * 格式：'字段名'	=>	['规则1','规则2'...]
     *
     * @var array
     */	
	protected $rule = [
        'qq' => 'min:6|max:10|number',
        'bio' => 'min:3|max:30',
        'email' => 'email',
        'mobile' => 'mobile',
        'password' => ['min' => 6, 'max' => 12, 'regex' => '/^(?![0-9]+$)(?![a-z]+$)(?![A-Z]+$)(?!([^(0-9a-zA-Z)]|[\(\)])+$)([^(0-9a-zA-Z)]|[\(\)]|[a-z]|[A-Z]|[0-9]){6,}$/
'],
    ];
    
    /**
     * 定义错误信息
     * 格式：'字段名.规则名'	=>	'错误信息'
     *
     * @var array
     */	
    protected $message = [
    
        'qq.number' => '请输入正确QQ号',
        'qq.min' => '昵称不能小于6个字符',
        'qq.max' => '昵称不能大于10个字符',
        'bio.min' => '简介不能小于3个字符',
        'bio.max' => '简介不能大于30个字符',
        'email.email' => '邮箱格式不正确',
        'mobile.mobile' => '手机号格式不正确',
        'password.min' => '密码不能小于6个字符',
        'password.max' => '密码不能大于12个字符',
        'password.regex' => '密码必须包含大小写字母/数字/符号任意两者组合',
    ];
}
